// first_iskutstven.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
	
	double weight_0_1[9][27] =
	{
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9},
	{0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9, 0.1 , 0.3 , 0.3 , 0.4 , 0.5 , 0.6 , 0.7 , 0.8 , 0.9}
	};


	

	

	std::cout << "Hello World!\n"<< weight_1_2[0][1];
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
